wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uart_reg.h
 * |        |          |Note: This bit is set when the number of usage in TX FIFO Buffer is equal to 16, otherwise it is cleared by hardware.
 * |[24]    |TXOVIF    |TX Overflow Error Interrupt Flag
 * |        |          |If TX FIFO (UART_DAT) is full, an additional write to UART_DAT will cause this bit to logic 1.
 * |        |          |0 = TX FIFO is not overflow.
 * |        |          |1 = TX FIFO is overflow.
 * |        |          |Note: This bit can be cleared by writing "1" to it.
 * |[28]    |TXEMPTYF  |Transmitter Empty Flag (Read Only)
 * |        |          |This bit is set by hardware when TX FIFO (UART_DAT) is empty and the STOP bit of the last byte has been transmitted.
 * |        |          |0 = TX FIFO is not empty or the STOP bit of the last byte has been not transmitted.
 * |        |          |1 = TX FIFO is empty and the STOP bit of the last byte has been transmitted.
 * |        |          |Note: This bit is cleared automatically when TX FIFO is not empty or the last byte transmission has not completed.
 * |[29]    |RXIDLE    |RX Idle Status (Read Only)
 * |        |          |This bit is set by hardware when RX is idle.
 * |        |          |0 = RX is busy.
 * |        |          |1 = RX is idle. (Default)
 * |[31]    |TXRXACT   |TX and RX Active Status (Read Only)
 * |        |          |This bit indicates TX and RX are active or inactive.
 * |        |          |0 = TX and RX are inactive.
 * |        |          |1 = TX and RX are active. (Default)
 * |        |          |Note: When TXRXDIS (UART_FUNCSEL[3]) is set and both TX and RX are in idle state, this bit is cleared
 * |        |          |The UART controller cannot transmit or receive data at this moment
 * |        |          |Otherwise this bit is set.
 * @var UART_T::INTSTS
 * Offset: 0x1C  UART Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RDAIF     |Receive Data Available Interrupt Flag
 * |        |          |When the number of bytes in the RX FIFO equals the RFITL then the RDAIF(UART_INTSTS[0]) will be set
 * |        |          |If RDAIEN (UART_INTEN [0]) is enabled, the RDA interrupt will be generated.
 * |        |          |0 = No RDA interrupt flag is generated.
 * |        |          |1 = RDA interrupt flag is generated.
 * |        |          |Note: This bit is read only and it will be cleared when the number of unread bytes of RX FIFO drops below the threshold level (RFITL(UART_FIFO[7:4]).
 * |[1]     |THREIF    |Transmit Holding Register Empty Interrupt Flag
 * |        |          |This bit is set when the last data of TX FIFO is transferred to Transmitter Shift Register
 * |        |          |If THREIEN (UART_INTEN[1]) is enabled, the THRE interrupt will be generated.
 * |        |          |0 = No THRE interrupt flag is generated.
 * |        |          |1 = THRE interrupt flag is generated.
 * |        |          |Note: This bit is read only and it will be cleared when writing data into UART_DAT (TX FIFO not empty).
 * |[2]     |RLSIF     |Receive Line Interrupt Flag (Read Only)
 * |        |          |This bit is set when the RX receive data have parity error, frame error or break error (at least one of 3 bits, BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]), is set)
 * |        |          |If RLSIEN (UART_INTEN [2]) is enabled, the RLS interrupt will be generated.
 * |        |          |0 = No RLS interrupt flag is generated.
 * |        |          |1 = RLS interrupt flag is generated.
 * |        |          |Note 1: In RS-485 function mode, this field is set include "receiver detect and received address byte character (bit9 = '1') bit"
 * |        |          |At the same time, the bit of ADDRDETF (UART_FIFOSTS[3]) is also set.
 * |        |          |Note 2: This bit is read only and reset to 0 when all bits of BIF (UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]) are cleared.
 * |        |          |Note 3: In RS-485 function mode, this bit is read only and reset to 0 when all bits of BIF (UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]), PEF(UART_FIFOSTS[4]) and ADDRDETF (UART_FIFOSTS[3]) are cleared.
 * |[3]     |MODEMIF   |MODEM Interrupt Flag (Read Only)
 * |        |          |This bit is set when the nCTS pin has state change (CTSDETF (UART_MODEMSTS[0]) = 1)
 * |        |          |If MODEMIEN (UART_INTEN [3]) is enabled, the Modem interrupt will be generated.
 * |        |          |0 = No Modem interrupt flag is generated.
 * |        |          |1 = Modem interrupt flag is generated.
 * |        |          |Note: This bit is read only and reset to 0 when bit CTSDETF is cleared by a write 1 on CTSDETF(UART_MODEMSTS[0]).
 * |[4]     |RXTOIF    |RX Time-out Interrupt Flag (Read Only)
 * |        |          |This bit is set when the RX FIFO is not empty and no activities occurred in the RX FIFO and the time-out counter equal to TOIC (UART_TOUT[7:0])
 * |        |          |If RXTOIEN (UART_INTEN [4]) is enabled, the RX time-out interrupt will be generated.
 * |        |          |0 = No RX time-out interrupt flag is generated.
 * |        |          |1 = RX time-out interrupt flag is generated.
 * |        |          |Note: This bit is read only and user can read UART_DAT (RX is in active) to clear it.
 * |[5]     |BUFERRIF  |Buffer Error Interrupt Flag (Read Only)
 * |        |          |This bit is set when the TX FIFO or RX FIFO overflows (TXOVIF (UART_FIFOSTS[24]) or RXOVIF (UART_FIFOSTS[0]) is set)
 * |        |          |When BUFERRIF (UART_INTSTS[5]) is set, the transfer is not correct
 * |        |          |If BUFERRIEN (UART_INTEN [5]) is enabled, the buffer error interrupt will be generated.
 * |        |          |0 = No buffer error interrupt flag is generated.
 * |        |          |1 = Buffer error interrupt flag is generated.
 * |        |          |Note: This bit is cleared if both of RXOVIF(UART_FIFOSTS[0]) and TXOVIF(UART_FIFOSTS[24]) are cleared to 0 by writing 1 to RXOVIF(UART_FIFOSTS[0]) and TXOVIF(UART_FIFOSTS[24]).
 * |[6]     |WKIF      |UART Wake-up Interrupt Flag (Read Only)
 * |        |          |This bit is set when TOUTWKF (UART_WKSTS[4]), RS485WKF (UART_WKSTS[3]), RFRTWKF (UART_WKSTS[2]), DATWKF (UART_WKSTS[1]) or CTSWKF(UART_WKSTS[0]) is set to 1.
 * |        |          |0 = No UART wake-up interrupt flag is generated.
 * |        |          |1 = UART wake-up interrupt flag is generated.
 * |        |          |Note: This bit is cleared if all of DATWKF and CTSWKF are cleared to 0 by writing 1 to the corresponding interrupt flag.
 * |[7]     |LINIF     |LIN Bus Interrupt Flag
 * |        |          |This bit is set when LIN slave header detect (SLVHDETF (UART_LINSTS[0] =1)), LIN break detect (BRKDETF(UART_LINSTS[8]=1)), bit error detect (BITEF(UART_LINSTS[9]=1)), LIN slave ID parity error (SLVIDPEF(UART_LINSTS[2] = 1)) or LIN slave header error detect (SLVHEF (UART_LINSTS[1]))
 * |        |          |If LINIEN (UART_INTEN [8]) is enabled the LIN interrupt will be generated.
 * |        |          |0 = None of SLVHDETF, BRKDETF, BITEF, SLVIDPEF and SLVHEF is generated.
 * |        |          |1 = At least one of SLVHDETF, BRKDETF, BITEF, SLVIDPEF and SLVHEF is generated.
 * |        |          |Note: This bit is cleared when SLVHDETF(UART_LINSTS[0]), BRKDETF(UART_LINSTS[8]), BITEF(UART_LINSTS[9]), SLVIDPEF (UART_LINSTS[2]) and SLVHEF(UART_LINSTS[1]) all are cleared and software writing '1' to LINIF(UART_INTSTS[7]).
 * |[8]     |RDAINT    |Receive Data Available Interrupt Indicator (Read Only)
 * |        |          |This bit is set if RDAIEN (UART_INTEN[0]) and RDAIF (UART_INTSTS[0]) are both set to 1.
 * |        |          |0 = No RDA interrupt is generated.
 * |        |          |1 = RDA interrupt is generated.
 * |[9]     |THREINT   |Transmit Holding Register Empty Interrupt Indicator (Read Only)
 * |        |          |This bit is set if THREIEN (UART_INTEN[1]) and THREIF(UART_INTSTS[1]) are both set to 1.
 * |        |          |0 = No THRE interrupt is generated.
 * |        |          |1 = THRE interrupt is generated.
 * |[10]    |RLSINT    |Receive Line Status Interrupt Indicator (Read Only)
 * |        |          |This bit is set if RLSIEN (UART_INTEN[2]) and RLSIF(UART_INTSTS[2]) are both set to 1.
 * |        |          |0 = No RLS interrupt is generated.
 * |        |          |1 = RLS interrupt is generated.
 * |[11]    |MODEMINT  |MODEM Status Interrupt Indicator (Read Only)
 * |        |          |This bit is set if MODEMIEN(UART_INTEN[3]) and MODEMIF(UART_INTSTS[3]) are both set to 1
 * |        |          |0 = No Modem interrupt is generated.
 * |        |          |1 = Modem interrupt is generated..
 * |[12]    |RXTOINT   |RX Time-out Interrupt Indicator (Read Only)
 * |        |          |This bit is set if RXTOIEN (UART_INTEN[4]) and RXTOIF(UART_INTSTS[4]) are both set to 1.
 * |        |          |0 = No RX time-out interrupt is generated.
 * |        |          |1 = RX time-out interrupt is generated.
 * |[13]    |BUFERRINT |Buffer Error Interrupt Indicator (Read Only)
 * |        |          |This bit is set if BUFERRIEN(UART_INTEN[5]) and BUFERRIF(UART_ INTSTS[5]) are both set to 1.
 * |        |          |0 = No buffer error interrupt is generated.
 * |        |          |1 = Buffer error interrupt is generated.
 * |[14]    |WKINT     |UART Wake-up Interrupt Indicator (Read Only)
 * |        |          |This bit is set if WKIEN (UART_INTEN[6]) and WKIF (UART_INTSTS[6]) are both set to 1.
 * |        |          |0 = No UART wake-up interrupt is generated.
 * |        |          |1 = UART wake-up interrupt is generated.
 * |[15]    |LININT    |LIN Bus Interrupt Indicator (Read Only)
 * |        |          |This bit is set if LINIEN (UART_INTEN[8]) and LINIF(UART_INTSTS[7]) are both set to 1.
 * |        |          |0 = No LIN Bus interrupt is generated.
 * |        |          |1 = The LIN Bus interrupt is generated.
 * |[16]    |SWBEIF    |Single-wire Bit Error Detection Interrupt Flag
 * |        |          |This bit is set when the single wire bus state not equals to UART controller TX state in Single-wire mode.
 * |        |          |0 = No single-wire bit error detection interrupt flag is generated.
 * |        |          |1 = Single-wire bit error detection interrupt flag is generated.
 * |        |          |Note 1: This bit is active when FUNCSEL (UART_FUNCSEL[2:0]) is select UART Single-wire mode.
 * |        |          |Note 2: This bit can be cleared by writing "1" to it.
 * |[18]    |HWRLSIF   |PDMA Mode Receive Line Status Flag (Read Only)
 * |        |          |This bit is set when the RX receive data have parity error, frame error or break error (at least one of 3 bits, BIF (UART_FIFOSTS[6]), FEF (UART_FIFOSTS[5]) and PEF (UART_FIFOSTS[4]) is set)
 * |        |          |If RLSIEN (UART_INTEN [2]) is enabled, the RLS interrupt will be generated.
 * |        |          |0 = No RLS interrupt flag is generated in PDMA mode.
 * |        |          |1 = RLS interrupt flag is generated in PDMA mode.
 * |        |          |Note 1: In RS-485 function mode, this field include "receiver detect any address byte received address byte character (bit9 = '1') bit".
 * |        |          |Note 2: In UART function mode, this bit is read only and reset to 0 when all bits of BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]) are cleared.
 * |        |          |Note 3: In RS-485 function mode, this bit is read only and reset to 0 when all bits of BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]), PEF(UART_FIFOSTS[4]) and ADDRDETF (UART_FIFOSTS[3]) are cleared
 * |[19]    |HWMODIF   |PDMA Mode MODEM Interrupt Flag (Read Only)
 * |        |          |This bit is set when the nCTS pin has state change (CTSDETF (UART_MODEMSTS [0] =1))
 * |        |          |If MODEMIEN (UART_INTEN [3]) is enabled, the Modem interrupt will be generated.
 * |        |          |0 = No Modem interrupt flag is generated in PDMA mode.
 * |        |          |1 = Modem interrupt flag is generated in PDMA mode.
 * |        |          |Note: This bit is read only and reset to 0 when the bit CTSDETF (UART_MODEMSTS[0]) is cleared by writing 1 on CTSDETF (UART_MODEMSTS [0]).
 * |[20]    |HWTOIF    |PDMA Mode RX Time-out Interrupt Flag (Read Only)
 * |        |          |This bit is set when the RX FIFO is not empty and no activities occurred in the RX FIFO and the time-out counter equal to TOIC (UART_TOUT[7:0])
 * |        |          |If RXTOIEN (UART_INTEN [4]) is enabled, the RX time-out interrupt will be generated .
 * |        |          |0 = No RX time-out interrupt flag is generated in PDMA mode.
 * |        |          |1 = RX time-out interrupt flag is generated in PDMA mode.
 * |        |          |Note: This bit is read only and user can read UART_DAT (RX is in active) to clear it.
 * |[21]    |HWBUFEIF  |PDMA Mode Buffer Error Interrupt Flag (Read Only)
 * |        |          |This bit is set when the TX or RX FIFO overflows (TXOVIF (UART_FIFOSTS [24]) or RXOVIF (UART_FIFOSTS[0]) is set)
 * |        |          |When BUFERRIF (UART_INTSTS[5]) is set, the transfer maybe is not correct
 * |        |          |If BUFERRIEN (UART_INTEN [5]) is enabled, the buffer error interrupt will be generated.
 * |        |          |0 = No buffer error interrupt flag is generated in PDMA mode.
 * |        |          |1 = Buffer error interrupt flag is generated in PDMA mode.
 * |        |          |Note: This bit is cleared when both TXOVIF (UART_FIFOSTS[24]]) and RXOVIF (UART_FIFOSTS[0]) are cleared.
 * |[22]    |TXENDIF   |Transmitter Empty Interrupt Flag
 * |        |          |This bit is set when TX FIFO (UART_DAT) is empty and the STOP bit of the last byte has been transmitted (TXEMPTYF (UART_FIFOSTS[28]) is set)
 * |        |          |If TXENDIEN (UART_INTEN[22]) is enabled, the Transmitter Empty interrupt will be generated.
 * |        |          |0 = No transmitter empty interrupt flag is generated.
 * |        |          |1 = Transmitter empty interrupt flag is generated.
 * |        |          |Note: This bit is cleared automatically when TX FIFO is not empty or the last byte transmission has not completed.
 * |[24]    |SWBEINT   |Single-wire Bit Error Detect Interrupt Indicator (Read Only)
 * |        |          |This bit is set if SWBEIEN (UART_INTEN[16]) and SWBEIF (UART_INTSTS[16]) are both set to 1.
 * |        |          |0 = No Single-wire Bit Error Detection Interrupt generated.
 * |        |          |1 = Single-wire Bit Error Detection Interrupt generated.
 * |[26]    |HWRLSINT  |PDMA Mode Receive Line Status Interrupt Indicator (Read Only)
 * |        |          |This bit is set if RLSIEN (UART_INTEN[2]) and HWRLSIF(UART_INTSTS[18]) are both set to 1.
 * |        |          |0 = No RLS interrupt is generated in PDMA mode.
 * |        |          |1 = RLS interrupt is generated in PDMA mode.
 * |[27]    |HWMODINT  |PDMA Mode MODEM Status Interrupt Indicator (Read Only)
 * |        |          |This bit is set if MODEMIEN (UART_INTEN[3]) and HWMODIF(UART_INTSTS[19]) are both set to 1.
 * |        |          |0 = No Modem interrupt is generated in PDMA mode.
 * |        |          |1 = Modem interrupt is generated in PDMA mode.
 * |[28]    |HWTOINT   |PDMA Mode RX Time-out Interrupt Indicator (Read Only)
 * |        |          |This bit is set if RXTOIEN (UART_INTEN[4]) and HWTOIF(UART_INTSTS[20]) are both set to 1.
 * |        |          |0 = No RX time-out interrupt is generated in PDMA mode.
 * |        |          |1 = RX time-out interrupt is generated in PDMA mode.
 * |[29]    |HWBUFEINT |PDMA Mode Buffer Error Interrupt Indicator (Read Only)
 * |        |          |This bit is set if BUFERRIEN (UART_INTEN[5]) and HWBUFEIF (UART_INTSTS[21]) are both set to 1.
 * |        |          |0 = No buffer error interrupt is generated in PDMA mode.
 * |        |          |1 = Buffer error interrupt is generated in PDMA mode.
 * |[30]    |TXENDINT  |Transmitter Empty Interrupt Indicator (Read Only)
 * |        |          |This bit is set if TXENDIEN (UART_INTEN[22]) and TXENDIF(UART_INTSTS[22]) are both set to 1.
 * |        |          |0 = No Transmitter Empty interrupt is generated.
 * |        |          |1 = Transmitter Empty interrupt is generated.
 * |[31]    |ABRINT    |Auto-baud Rate Interrupt Indicator (Read Only)
 * |        |          |This bit is set if ABRIEN (UART_INTEN[18]) and ABRIF (UART_ALTCTL[17]) are both set to 1.
 * |        |          |0 = No Auto-baud Rate interrupt is generated.
 * |        |          |1 = The Auto-baud Rate interrupt is generated.
 * @var UART_T::TOUT
 * Offset: 0x20  UART Time-out Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TOIC      |Time-out Interrupt Comparator
 * |        |          |The time-out counter resets and starts counting (the counting clock = baud rate) whenever the RX FIFO receives a new data word if time out counter is enabled by setting TOCNTEN (UART_INTEN[11])
 * |        |          |Once the content of time-out counter is equal to that of time-out interrupt comparator (TOIC (UART_TOUT[7:0])), a receiver time-out interrupt (RXTOINT(UART_INTSTS[12])) is generated if RXTOIEN (UART_INTEN [4]) enabled
 * |        |          |A new incoming data word or RX FIFO empty will clear RXTOIF (UART_INTSTS[4])
 * |        |          |In order to avoid receiver time-out interrupt generation immediately during one character is being received, TOIC value should be set between 40 and 255
 * |        |          |So, for example, if TOIC is set with 40, the time-out interrupt is generated after four characters are not received when 1 stop bit and no parity check is set for UART transfer.
 * |[15:8]  |DLY       |TX Delay Time Value
 * |        |          |This field is used to programming the transfer delay time between the last stop bit and next start bit
 * |        |          |The unit is bit time.
 * @var UART_T::BAUD
 * Offset: 0x24  UART Baud Rate Divider Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |BRD       |Baud Rate Divider
 * |        |          |The field indicates the baud rate divider
 * |        |          |This filed is used in baud rate calculation
 * |        |          |The detail description is shown in Table 6.12-4.
 * |[27:24] |EDIVM1    |Extra Divider for BAUD Rate Mode 1
 * |        |          |This field is used for baud rate calculation in mode 1 and has no effect for baud rate calculation in mode 0 and mode 2
 * |        |          |The detail description is shown in Table 6.12-4
 * |[28]    |BAUDM0    |BAUD Rate Mode Selection Bit 0
 * |        |          |This bit is baud rate mode selection bit 0
 * |        |          |UART provides three baud rate calculation modes
 * |        |          |This bit combines with BAUDM1 (UART_BAUD[29]) to select baud rate calculation mode
 * |        |          |The detail description is shown in Table 6.12-4.
 * |[29]    |BAUDM1    |BAUD Rate Mode Selection Bit 1
 * |        |          |This bit is baud rate mode selection bit 1
 * |        |          |UART provides three baud rate calculation modes
 * |        |          |This bit combines with BAUDM0 (UART_BAUD[28]) to select baud rate calculation mode
 * |        |          |The detail description is shown in Table 6.12-4.
 * |        |          |Note: In IrDA mode must be operated in mode 0.
 * @var UART_T::IRDA
 * Offset: 0x28  UART IrDA Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TXEN      |IrDA Receiver/Transmitter Selection Enable Bit
 * |        |          |0 = IrDA Transmitter Disabled and Receiver Enabled. (Default)
 * |        |          |1 = IrDA Transmitter Enabled and Receiver Disabled.
 * |[5]     |TXINV     |IrDA Inverse Transmitting Output Signal
 * |        |          |0 = None inverse transmitting signal. (Default).
 * |        |          |1 = Inverse transmitting output signal.
 * |        |          |Note 1: Before setting this bit, TXRXDIS (UART_FUNCSEL[3]) should be set then waited for TXRXACT (UART_FIFOSTS[31]) is cleared
 * |        |          |When the configuration is done, cleared TXRXDIS (UART_FUNCSEL[3]) to activate UART controller.
 * |        |          |Note 2: This bit is valid when FUNCSEL (UART_FUNCSEL[2:0]) is select IrDA function.
 * |[6]     |RXINV     |IrDA Inverse Receive Input Signal
 * |        |          |0 = None inverse receiving input signal.
 * |        |          |1 = Inverse receiving input signal. (Default)
 * |        |          |Note 1: Before setting this bit, TXRXDIS (UART_FUNCSEL[3]) should be set then waited for TXRXACT (UART_FIFOSTS[31]) is cleared
 * |        |          |When the configuration is done, cleared TXRXDIS (UART_FUNCSEL[3]) to activate UART controller.
 * |        |          |Note 2: This bit is valid when FUNCSEL (UART_FUNCSEL[2:0]) is select IrDA function.
 * @var UART_T::ALTCTL
 * Offset: 0x2C  UART Alternate Control/Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |BRKFL     |UART LIN Break Field Length
 * |        |          |This field indicates a 4-bit LIN TX break field count.
 * |        |          |Note 1: This break field length is BRKFL + 1.
 * |        |          |Note 2: According to LIN spec, the reset value is 0xC (break field length = 13).
 * |[5]     |LINAUTO   |LIN Auto Header Control
 * |        |          |0 = LIN Auto Header Disable.
 * |        |          |1 = LIN Auto Header Enable.
 * |[6]     |LINRXEN   |LIN RX Enable Bit
 * |        |          |0 = LIN RX mode Disabled.
 * |        |          |1 = LIN RX mode Enabled.
 * |[7]     |LINTXEN   |LIN TX Break Mode Enable Bit
 * |        |          |0 = LIN TX Break mode Disabled.
 * |        |          |1 = LIN TX Break mode Enabled.
 * |        |          |Note: When TX break field transfer operation finished, this bit will be cleared automatically.
 * |[8]     |RS485NMM  |RS-485 Normal Multi-drop Operation Mode
 * |        |          |0 = RS-485 Normal Multi-drop Operation mode (NMM) Disabled.
 * |        |          |1 = RS-485 Normal Multi-drop Operation mode (NMM) Enabled.
 * |        |          |Note: It cannot be active with RS-485_AAD operation mode.
 * |[9]     |RS485AAD  |RS-485 Auto Address Detection Operation Mode
 * |        |          |0 = RS-485 Auto Address Detection Operation mode (AAD) Disabled.
 * |        |          |1 = RS-485 Auto Address Detection Operation mode (AAD) Enabled.
 * |        |          |Note: It cannot be active with RS-485_NMM operation mode.
 * |[10]    |RS485AUD  |RS-485 Auto Direction Function
 * |        |          |0 = RS-485 Auto Direction Operation function (AUD) Disabled.
 * |        |          |1 = RS-485 Auto Direction Operation function (AUD) Enabled.
 * |        |          |Note: It can be active with RS-485_AAD or RS-485_NMM operation mode.
 * |[15]    |ADDRDEN   |RS-485 Address Detection Enable Bit
 * |        |          |This bit is used to enable RS-485 Address Detection mode.
 * |        |          |0 = Address detection mode Disabled.
 * |        |          |1 = Address detection mode Enabled.
 * |        |          |Note: This bit is used for RS-485 any operation mode.
 * |[17]    |ABRIF     |Auto-baud Rate Interrupt Flag (Read Only)
