wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uart_reg.h
 * |        |          |This bit is set when auto-baud rate detection function finished or the auto-baud rate counter was overflow and if ABRIEN(UART_INTEN [18]) is set then the auto-baud rate interrupt will be generated.
 * |        |          |0 = No auto-baud rate interrupt flag is generated.
 * |        |          |1 = Auto-baud rate interrupt flag is generated.
 * |        |          |Note: This bit is read only, but it can be cleared by writing "1" to ABRDTOIF (UART_FIFOSTS[2]) and ABRDIF(UART_FIFOSTS[1])
 * |[18]    |ABRDEN    |Auto-baud Rate Detect Enable Bit
 * |        |          |0 = Auto-baud rate detect function Disabled.
 * |        |          |1 = Auto-baud rate detect function Enabled.
 * |        |          |Note : This bit is cleared automatically after auto-baud detection is finished.
 * |[20:19] |ABRDBITS  |Auto-baud Rate Detect Bit Length
 * |        |          |00 = 1-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x01.
 * |        |          |01 = 2-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x02.
 * |        |          |10 = 4-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x08.
 * |        |          |11 = 8-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x80.
 * |        |          |Note : The calculation of bit number includes the START bit.
 * |[31:24] |ADDRMV    |Address Match Value
 * |        |          |This field contains the RS-485 address match values.
 * |        |          |Note: This field is used for RS-485 auto address detection mode.
 * @var UART_T::FUNCSEL
 * Offset: 0x30  UART Function Select Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |FUNCSEL   |Function Select
 * |        |          |000 = UART function.
 * |        |          |001 = LIN function.
 * |        |          |010 = IrDA function.
 * |        |          |011 = RS-485 function.
 * |        |          |100 = UART Single-wire function.
 * |        |          |Others = Reserved.
 * |[3]     |TXRXDIS   |TX and RX Disable Bit
 * |        |          |Setting this bit can disable TX and RX.
 * |        |          |0 = TX and RX Enabled.
 * |        |          |1 = TX and RX Disabled.
 * |        |          |Note: The TX and RX will not be disabled immediately when this bit is set
 * |        |          |The TX and RX complete current task before TX and RX are disabled
 * |        |          |When TX and RX are disabled, the TXRXACT (UART_FIFOSTS[31]) is cleared.
 * |[6]     |DGE       |Deglitch Enable Bit
 * |        |          |0 = Deglitch Disabled.
 * |        |          |1 = Deglitch Enabled.
 * |        |          |Note 1: When this bit is set to logic 1, any pulse width less than about 150 ns will be considered a glitch and will be removed in the serial data input (RX)
 * |        |          |This bit acts only on RX line and has no effect on the transmitter logic.
 * |        |          |Note 2: It is recommended to set this bit only when operating at baud rate under 2.5 Mbps.
 * |[7]     |TXRXSWP   |TX and RX Swap Enable Bit
 * |        |          |Setting this bit Swaps TX pin and RX pin.
 * |        |          |0 = TX and RX Swap Disabled.
 * |        |          |1 = TX and RX Swap Enabled.
 * @var UART_T::LINCTL
 * Offset: 0x34  UART LIN Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SLVEN     |LIN Slave Mode Enable Bit
 * |        |          |0 = LIN slave mode Disabled.
 * |        |          |1 = LIN slave mode Enabled.
 * |[1]     |SLVHDEN   |LIN Slave Header Detection Enable Bit
 * |        |          |0 = LIN slave header detection Disabled.
 * |        |          |1 = LIN slave header detection Enabled.
 * |        |          |Note 1: This bit is only valid in LIN slave mode (SLVEN (UART_LINCTL[0]) = 1).
 * |        |          |Note 2: In LIN function mode, when detect header field (break + sync + frame ID), SLVHDETF (UART_LINSTS [0]) flag will be asserted
 * |        |          |If the LINIEN (UART_INTEN[8]) = 1, an interrupt will be generated.
 * |[2]     |SLVAREN   |LIN Slave Automatic Resynchronization Mode Enable Bit
 * |        |          |0 = LIN automatic resynchronization Disabled.
 * |        |          |1 = LIN automatic resynchronization Enabled.
 * |        |          |Note 1: This bit only is valid in LIN slave mode (SLVEN (UART_LINCTL[0]) = 1).
 * |        |          |Note 2: When operation in Automatic Resynchronization mode, the baud rate setting must be mode2 (BAUDM1 (UART_BAUD [29]) and BAUDM0 (UART_BAUD [28]) must be 1).
 * |        |          |Note 3: The control and interactions of this field are explained in 6.15.5.10 (Slave mode with automatic resynchronization).
 * |[3]     |SLVDUEN   |LIN Slave Divider Update Method Enable Bit
 * |        |          |0 = UART_BAUD updated is written by software (if no automatic resynchronization update occurs at the same time).
 * |        |          |1 = UART_BAUD is updated at the next received character
 * |        |          |User must set the bit before checksum reception.
 * |        |          |Note 1: This bit only is valid in LIN slave mode (SLVEN (UART_LINCTL[0]) = 1).
 * |        |          |Note 2: This bit used for LIN Slave Automatic Resynchronization mode
 * |        |          |(for Non-Automatic Resynchronization mode, this bit should be kept cleared)
 * |        |          |Note 3: The control and interactions of this field are explained in 6.15.5.10 (Slave mode with automatic resynchronization).
 * |[4]     |MUTE      |LIN Mute Mode Enable Bit
 * |        |          |0 = LIN mute mode Disabled.
 * |        |          |1 = LIN mute mode Enabled.
 * |        |          |Note: The exit from mute mode condition and each control and interactions of this field are explained in 6.15.5.10 (LIN slave mode).
 * |[8]     |SENDH     |LIN TX Send Header Enable Bit
 * |        |          |The LIN TX header can be "break field" or "break and sync field" or "break, sync and frame ID field", it is depend on setting HSEL (UART_LINCTL[23:22]).
 * |        |          |0 = Send LIN TX header Disabled.
 * |        |          |1 = Send LIN TX header Enabled.
 * |        |          |Note 1: This bit is shadow bit of LINTXEN (UART_ALTCTL [7]); user can read/write it by setting LINTXEN (UART_ALTCTL [7]) or SENDH (UART_LINCTL [8]).
 * |        |          |Note 2: When transmitter header field (it may be "break" or "break + sync" or "break + sync + frame ID" selected by HSEL (UART_LINCTL[23:22]) field) transfer operation finished, this bit will be cleared automatically.
 * |[9]     |IDPEN     |LIN ID Parity Enable Bit
 * |        |          |0 = LIN frame ID parity Disabled.
 * |        |          |1 = LIN frame ID parity Enabled.
 * |        |          |Note 1: This bit can be used for LIN master to sending header field (SENDH (UART_LINCTL[8])) = 1 and HSEL (UART_LINCTL[23:22]) = 10 or be used for enable LIN slave received frame ID parity checked.
 * |        |          |Note 2: This bit is only used when the operation header transmitter is in HSEL (UART_LINCTL[23:22]) = 10
 * |[10]    |BRKDETEN  |LIN Break Detection Enable Bit
 * |        |          |When detect consecutive dominant greater than 11 bits, and are followed by a delimiter character, the BRKDETF (UART_LINSTS[8]) flag is set at the end of break field
 * |        |          |If the LINIEN (UART_INTEN [8])=1, an interrupt will be generated.
 * |        |          |0 = LIN break detection Disabled .
 * |        |          |1 = LIN break detection Enabled.
 * |[11]    |LINRXOFF  |LIN Receiver Disable Bit
 * |        |          |If the receiver is enabled (LINRXOFF (UART_LINCTL[11]) = 0), all received byte data will be accepted and stored in the RX FIFO, and if the receiver is disabled (LINRXOFF (UART_LINCTL[11] = 1), all received byte data will be ignore.
 * |        |          |0 = LIN receiver Enabled.
 * |        |          |1 = LIN receiver Disabled.
 * |        |          |Note: This bit is only valid when operating in LIN function mode (FUNCSEL (UART_FUNCSEL[2:0]) = 001).
 * |[12]    |BITERREN  |Bit Error Detect Enable Bit
 * |        |          |0 = Bit error detection function Disabled.
 * |        |          |1 = Bit error detection function Enabled.
 * |        |          |Note: In LIN function mode, when occur bit error, the BITEF (UART_LINSTS[9]) flag will be asserted
 * |        |          |If the LINIEN (UART_INTEN[8]) = 1, an interrupt will be generated.
 * |[15]    |LINLBDL   |LIN Length of Break Detect
 * |        |          |0 = Detect Break 11 Bits.
 * |        |          |1 = Detect Break 10 Bits.
 * |[19:16] |BRKFL     |LIN Break Field Length
 * |        |          |This field indicates a 4-bit LIN TX break field count.
 * |        |          |Note 1: These registers are shadow registers of BRKFL (UART_ALTCTL[3:0]), User can read/write it by setting BRKFL (UART_ALTCTL[3:0]) or BRKFL (UART_LINCTL[19:16]).
 * |        |          |Note 2: This break field length is BRKFL + 1.
 * |        |          |Note 3: According to LIN spec, the reset value is 12 (break field length = 13).
 * |[21:20] |BSL       |LIN Break/Sync Delimiter Length
 * |        |          |00 = The LIN break/sync delimiter length is 1-bit time.
 * |        |          |01 = The LIN break/sync delimiter length is 2-bit time.
 * |        |          |10 = The LIN break/sync delimiter length is 3-bit time.
 * |        |          |11 = The LIN break/sync delimiter length is 4-bit time.
 * |        |          |Note: This bit used for LIN master to sending header field.
 * |[23:22] |HSEL      |LIN Header Select
 * |        |          |00 = The LIN header includes "break field".
 * |        |          |01 = The LIN header includes "break field" and "sync field".
 * |        |          |10 = The LIN header includes "break field", "sync field" and "frame ID field".
 * |        |          |11 = Reserved.
 * |        |          |Note: This bit is used to master mode for LIN to send header field (SENDH (UART_LINCTL [8]) = 1) or used to slave to indicates exit from mute mode condition (MUTE (UART_LINCTL[4] = 1).
 * |[31:24] |PID       |LIN PID Bits
 * |        |          |This field contains the LIN frame ID value in LIN function mode, and the frame ID parity can be generated by software or hardware depends on IDPEN (UART_LINCTL[9]) = 1.
 * |        |          |If the parity generated by hardware, user fill ID0~ID5 (PID [29:24]), hardware will calculate P0 (PID[30]) and P1 (PID[31]), otherwise user must filled frame ID and parity in this field.
 * |        |          |Note 1: User can fill any 8-bit value to this field and the bit 24 indicates ID0 (LSB first).
 * |        |          |Note 2: This field can be used for LIN master mode or slave mode.
 * @var UART_T::LINSTS
 * Offset: 0x38  UART LIN Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SLVHDETF  |LIN Slave Header Detection Flag
 * |        |          |This bit is set by hardware when a LIN header is detected in LIN slave mode and be cleared by writing 1 to it.
 * |        |          |0 = LIN header not detected.
 * |        |          |1 = LIN header detected (break + sync + frame ID).
 * |        |          |Note 1: This bit can be cleared by writing 1 to it.
 * |        |          |Note 2: This bit is only valid in LIN slave mode (SLVEN (UART_LINCTL [0]) = 1) and enable LIN slave header detection function (SLVHDEN (UART_LINCTL [1])).
 * |        |          |Note 3: When enable ID parity check IDPEN (UART_LINCTL [9]), if hardware detect complete header ("break + sync + frame ID"), the SLVHDETF will be set whether the frame ID correct or not.
 * |[1]     |SLVHEF    |LIN Slave Header Error Flag
 * |        |          |This bit is set by hardware when a LIN header error is detected in LIN slave mode and be cleared by writing 1 to it
 * |        |          |The header errors include "break delimiter is too short (less than 0.5 bit time)", "frame error in sync field or Identifier field", "sync field data is not 0x55 in Non-Automatic Resynchronization mode", "sync field deviation error with Automatic Resynchronization mode", "sync field measure time-out with Automatic Resynchronization mode" and "LIN header reception time-out".
 * |        |          |0 = LIN header error not detected.
 * |        |          |1 = LIN header error detected.
 * |        |          |Note 1: This bit can be cleared by writing 1 to it.
 * |        |          |Note 2: This bit is only valid when UART is operated in LIN slave mode (SLVEN (UART_LINCTL [0]) = 1) and enables LIN slave header detection function (SLVHDEN (UART_LINCTL [1])).
 * |[2]     |SLVIDPEF  |LIN Slave ID Parity Error Flag
 * |        |          |This bit is set by hardware when receipted frame ID parity is not correct.
 * |        |          |0 = No active.
 * |        |          |1 = Receipted frame ID parity is not correct.
 * |        |          |Note 1: This bit can be cleared by writing 1 to it.
 * |        |          |Note 2: This bit is only valid in LIN slave mode (SLVEN (UART_LINCTL [0])= 1) and enable LIN frame ID parity check function IDPEN (UART_LINCTL [9]).
 * |[3]     |SLVSYNCF  |LIN Slave Sync Field
 * |        |          |This bit indicates that the LIN sync field is being analyzed in Automatic Resynchronization mode
 * |        |          |When the receiver header have some error been detect, user must reset the internal circuit to re-search new frame header by writing 1 to this bit.
 * |        |          |0 = The current character is not at LIN sync state.
 * |        |          |1 = The current character is at LIN sync state.
 * |        |          |Note 1: This bit is only valid in LIN Slave mode (SLVEN(UART_LINCTL[0]) = 1).
 * |        |          |Note 2: This bit can be cleared by writing 1 to it.
 * |        |          |Note 3: When writing 1 to it, hardware will reload the initial baud rate and re-search a new frame header.
 * |[8]     |BRKDETF   |LIN Break Detection Flag
 * |        |          |This bit is set by hardware when a break is detected and be cleared by writing 1 to it through software.
 * |        |          |0 = LIN break not detected.
 * |        |          |1 = LIN break detected.
 * |        |          |Note 1: This bit can be cleared by writing 1 to it.
 * |        |          |Note 2: This bit is only valid when LIN break detection function is enabled (BRKDETEN (UART_LINCTL[10]) =1).
 * |[9]     |BITEF     |Bit Error Detect Status Flag
 * |        |          |At TX transfer state, hardware will monitor the bus state, if the input pin (UART_RXD) state not equals to the output pin (UART_TXD) state, BITEF (UART_LINSTS[9]) will be set.
 * |        |          |When occur bit error, if the LINIEN (UART_INTEN[8]) = 1, an interrupt will be generated.
 * |        |          |0 = Bit error not detected.
 * |        |          |1 = Bit error detected.
 * |        |          |Note 1: This bit can be cleared by writing 1 to it.
 * |        |          |Note 2: This bit is only valid when enable bit error detection function (BITERREN (UART_LINCTL [12]) = 1).
 * @var UART_T::BRCOMP
 * Offset: 0x3C  UART Baud Rate Compensation Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8:0]   |BRCOMP    |Baud Rate Compensation Patten
 * |        |          |These 9-bits are used to define the relative bit is compensated or not.
 * |        |          |BRCOMP[7:0] is used to define the compensation of DAT (UART_DAT[7:0]) and BRCOM[8] is used to define PARITY (UART_DAT[8]).
 * |[31]    |BRCOMPDEC |Baud Rate Compensation Decrease
 * |        |          |0 = Positive (increase one module clock) compensation for each compensated bit.
 * |        |          |1 = Negative (decrease one module clock) compensation for each compensated bit.
 * @var UART_T::WKCTL
 * Offset: 0x40  UART Wake-up Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKCTSEN   |nCTS Wake-up Enable Bit
 * |        |          |0 = nCTS Wake-up system function Disabled.
 * |        |          |1 = nCTS Wake-up system function Enabled.
 * |        |          |Note: When the system is in Power-down mode, an external nCTS change will wake up system from Power-down mode.
 * |[1]     |WKDATEN   |Incoming Data Wake-up Enable Bit
 * |        |          |0 = Incoming data wake-up system function Disabled.
 * |        |          |1 = Incoming data wake-up system function Enabled.
 * |        |          |Note: When the system is in Power-down mode, incoming data will wake-up system from Power-down mode.
 * @var UART_T::WKSTS
 * Offset: 0x44  UART Wake-up Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CTSWKF    |nCTS Wake-up Flag
 * |        |          |This bit is set if chip wake-up from power-down state by nCTS wake-up.
 * |        |          |0 = Chip stays in power-down state.
 * |        |          |1 = Chip wake-up from power-down state by nCTS wake-up.
 * |        |          |Note 1: If WKCTSEN (UART_WKCTL[0]) is enabled, the nCTS wake-up cause this bit is set to '1'.
 * |        |          |Note 2: This bit can be cleared by writing '1' to it.
 * |[1]     |DATWKF    |Incoming Data Wake-up Flag
 * |        |          |This bit is set if chip wake-up from power-down state by data wake-up.
 * |        |          |0 = Chip stays in power-down state.
 * |        |          |1 = Chip wake-up from power-down state by Incoming Data wake-up.
 * |        |          |Note 1: If WKDATEN (UART_WKCTL[1]) is enabled, the Incoming Data wake-up cause this bit is set to '1'.
 * |        |          |Note 2: This bit can be cleared by writing '1' to it.
 * @var UART_T::DWKCOMP
 * Offset: 0x48  UART Incoming Data Wake-up Compensation Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |STCOMP    |Start Bit Compensation Value
 * |        |          |These bits field indicate how many clock cycle selected by UART_CLK do the UART controller can get the 1st bit (start bit) when the device is wake-up from Power-down mode.
 * |        |          |Note: It is valid only when WKDATEN (UART_WKCTL[1]) is set.
 */
    __IO uint32_t DAT;                   /*!< [0x0000] UART Receive/Transmit Buffer Register                            */
    __IO uint32_t INTEN;                 /*!< [0x0004] UART Interrupt Enable Register                                   */
    __IO uint32_t FIFO;                  /*!< [0x0008] UART FIFO Control Register                                       */
    __IO uint32_t LINE;                  /*!< [0x000c] UART Line Control Register                                       */
    __IO uint32_t MODEM;                 /*!< [0x0010] UART Modem Control Register                                      */
    __IO uint32_t MODEMSTS;              /*!< [0x0014] UART Modem Status Register                                       */
    __IO uint32_t FIFOSTS;               /*!< [0x0018] UART FIFO Status Register                                        */
    __IO uint32_t INTSTS;                /*!< [0x001c] UART Interrupt Status Register                                   */
    __IO uint32_t TOUT;                  /*!< [0x0020] UART Time-out Register                                           */
    __IO uint32_t BAUD;                  /*!< [0x0024] UART Baud Rate Divider Register                                  */
    __IO uint32_t IRDA;                  /*!< [0x0028] UART IrDA Control Register                                       */
    __IO uint32_t ALTCTL;                /*!< [0x002c] UART Alternate Control/Status Register                           */
    __IO uint32_t FUNCSEL;               /*!< [0x0030] UART Function Select Register                                    */
    __IO uint32_t LINCTL;                /*!< [0x0034] UART LIN Control Register                                        */
    __IO uint32_t LINSTS;                /*!< [0x0038] UART LIN Status Register                                         */
    __IO uint32_t BRCOMP;                /*!< [0x003c] UART Baud Rate Compensation Register                             */
    __IO uint32_t WKCTL;                 /*!< [0x0040] UART Wake-up Control Register                                    */
    __IO uint32_t WKSTS;                 /*!< [0x0044] UART Wake-up Status Register                                     */
    __IO uint32_t DWKCOMP;               /*!< [0x0048] UART Incoming Data Wake-up Compensation Register                 */

